{
    "projects": [
        {
            "id": "f09c0e03-9af7-42e5-b065-d6e73addc4bb",
            "title": "Neuron Net",
            "description": "Neuron Net is a decentralized GPU compute marketplace built on Monad. Idle GPUs become revenue-generating assets for providers, while developers and creators get instant, affordable compute power — without relying on AWS, Google Cloud, or Azure. Users can rent a GPU and access it remotely, hire a freelancer from our platform to handle their task, or use our in-house team directly. Every transaction is handled trustlessly via smart contracts on Monad — instant settlement, zero middlemen, no disputes. Monad's parallel execution and high throughput makes real-time job matching and micropayments viable at scale — something impossible on Ethereum. We're not just building a product, we're building the compute infrastructure layer for the next generation of AI developers who can't afford to be locked out.",
            "team_members": "Shlok Venkar, Shreyash Ahire, Soham Malekar",
            "github_url": "https://github.com/ShlokVenkar/Neuron-Net",
            "demo_url": "https://neuronnet-pjkm.vercel.app/",
            "category": "DeFi, Infrastructure, AI",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-shreyashahire.official@gmail.com-1771766022865.jpeg",
            "submitted_at": "2026-02-22T13:13:43.376949+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "bb085177-1d79-4928-978e-d178685cab24",
            "title": "OpTum-AI-MarketPlace",
            "description": "Here is a concise, high-impact description of your project that you can use for your hackathon submission, pitch deck, or GitHub \"About\" section:\r\n\r\nThe Elevator Pitch\r\nMonadMind is an AI-powered social trading layer that tokenizes and gates expert AI trading strategies. It allows \"Agent-Architects\" to publish autonomous trading logic (like the TariffTrigger AI) while enabling users to follow these strategies through a secure, \"Stake-to-Unlock\" mechanism.\r\n\r\nThe Problem it Solves\r\nIn modern markets, news (like global trade tariffs or macro-economic shifts) moves faster than human traders can react. However, most retail traders lack the technical infrastructure to deploy 24/7 autonomous agents. Furthermore, AI developers have no decentralized way to monetize their \"Alpha\" (trading secrets) without giving away their proprietary prompts.",
            "team_members": "Prem Dubay,Amit Yadav",
            "github_url": "https://github.com/MasterPrem001/Optum-AI-MarketPlace-",
            "demo_url": "https://github.com/MasterPrem001/Optum-AI-MarketPlace-",
            "category": "Defi,AI",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-masterprem001@gmail.com-1771765967334.jpeg",
            "submitted_at": "2026-02-22T13:12:48.036595+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "d973eae2-f6d9-44f1-a652-f059649d4a63",
            "title": "MonCircle",
            "description": "MonCircle is a decentralized loyalty infrastructure built on Monad that enables brands and marketplaces to launch programmable, on-chain reward economies directly within their existing e-commerce platforms. Rather than issuing platform-locked points, brands allocate a pool of MON tokens that users earn automatically through real purchasing behavior. These tokens are user-owned digital assets - visible across participating stores, redeemable at checkout, and withdrawable — transforming loyalty from a closed promotional mechanism into a portable layer of value.\r\n\r\nThrough a plug-and-play integration layer and its reference storefront, MonMart, MonCircle demonstrates how loyalty can operate as a live payment rail embedded directly into everyday commerce. Rewards are issued in real time at checkout, turning each transaction into a programmable incentive event.\r\n\r\nThe system aligns incentives for both customers and brands through behavior-aware reward logic. Users receive tangible, persistent loyalty that retains value beyond any single platform. Brands maintain policy-level control, enabling them to calibrate rewards based on genuine engagement - including safeguards for inactivity, excessive returns, or withdrawal thresholds.\r\n\r\nBuilt on Monad’s high-throughput, low-fee EVM architecture, MonCircle makes it economically viable to mint, distribute, and redeem millions of micro-rewards in real time. In doing so, it reframes loyalty from expiring points into user-owned value and establishes a shared, interoperable reward layer for the next generation of e-commerce.",
            "team_members": "Arav Arun , Aarav Bhatia , Ralston Dsouza",
            "github_url": "https://github.com/Arav-Arun/Monad-Blitz-v2_MonCircle",
            "demo_url": "https://moncircle.vercel.app/",
            "category": "Web3 Loyalty Infrastructure",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-aravarun1923@gmail.com-1771765907993.jpeg",
            "submitted_at": "2026-02-22T13:11:48.909558+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "a36180e9-3e3f-42fc-9c51-58611b60de23",
            "title": "Stake Your Goal",
            "description": "Stake Your Goal is a decentralized accountability platform built on Ethereum where users commit to personal goals by staking cryptocurrency. When a user creates a goal, their funds are locked in a smart contract until the deadline. To complete the goal, the user submits proof, which is stored on IPFS (via Pinata) for tamper-proof verification.\r\n\r\nAn AI verifier or trusted oracle evaluates the submitted proof. If the goal is successfully verified, the user receives their staked funds back along with an NFT badge as on-chain proof of achievement. If the goal is not completed, the staked amount is redirected to a predefined charity wallet or DAO treasury.\r\n\r\nThe system combines smart contracts, IPFS storage, and AI-based verification to create a transparent, secure, and financially incentivized goal-tracking mechanism.",
            "team_members": "Siddhesh Gharat, Chetan Banjan",
            "github_url": "https://github.com/Hunter0305/monad-blitz-mumbai",
            "demo_url": "https://github.com/Hunter0305/monad-blitz-mumbai",
            "category": "DeFi",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-siddheshgharat0305@gmail.com-1771765755274.png",
            "submitted_at": "2026-02-22T13:09:15.856527+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "d36f0b3c-538c-48b0-9859-a425199d7a42",
            "title": "Monad_Pay",
            "description": "Monad Pay is a gasless, conversational payment system built on Monad. Users interact through WhatsApp with natural language — the system handles wallet creation, gas sponsorship, and on-chain settlement behind the scenes.\r\n\r\nZero friction:\r\n\r\nNo app download → WhatsApp is pre-installed\r\nNo gas fees → Relayer pays all tx costs\r\nNo seed phrases → HD wallets auto-created & encrypted\r\nNo crypto jargon → Natural language commands",
            "team_members": "Ansh Goyanka",
            "github_url": "https://github.com/AnshGoyanka/Monad_Pay_",
            "demo_url": "https://youtu.be/nQo2DgWj6oE",
            "category": "Payments",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-anshgoynka@gmail.com-1771765719270.png",
            "submitted_at": "2026-02-22T13:08:39.748284+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "4c20848e-b082-4810-83be-c153c73321bf",
            "title": "PlugPort",
            "description": "Single step upgrade for Apps to become dApps, powered by MonadDB! \r\nPlugPort is a MongoDB Interface for MonadDB so all the developers can just leverage the web3 benefits without needing to go through the learning curve. Monad's superior offering over all other L1s & L2s is throughput and that's exactly what PlugPort leverages for any developers through a simple swap of Mongo's wire protocol endpoint or using any of the NodeJS/Python/Go SDKs for complex applications.\r\nPlugPort bridges the developer experience of MongoDB with the verifiable storage guarantees of MonadDb's Merkle Patricia Trie. Use familiar MongoDB drivers, queries, and tooling while your data is backed by blockchain-grade cryptographic proofs.",
            "team_members": "Shankar Warang, Meet Parekh",
            "github_url": "https://github.com/PlugPort-Protocol/plugport",
            "demo_url": "https://plugport.wtf",
            "category": "Dev Tooling",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-shankar.w@outlook.com-1771765573111.png",
            "submitted_at": "2026-02-22T13:06:13.568492+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "23ac9d6d-7d21-4c26-aea5-d97f6f02b7f0",
            "title": "Merkle-based Subscription",
            "description": "Merkle Subscription is a gas-efficient smart contract system on Monad Testnet that validates user subscriptions on-chain without storing large user lists. It uses a Rust backend to aggregate subscriber data into a single Merkle Root, which is regularly synced to the contract. Users can then independently prove their active subscription status to the network using off-chain generated Merkle proofs.",
            "team_members": "Shivam Prajapati",
            "github_url": "https://github.com/Shivam-Prajapati-59/checkstake/tree/main/monad-blitz-v2/merkle-based-subs",
            "demo_url": "https://github.com/Shivam-Prajapati-59/checkstake/tree/main/monad-blitz-v2/merkle-based-subs",
            "category": "Defi",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-workshivam00@gmail.com-1771765452666.png",
            "submitted_at": "2026-02-22T13:04:13.970564+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "c44beff1-0d7a-44a5-bc38-ae59bcca10ce",
            "title": "stop procastinating and execute",
            "description": "STFU & Execute is a Web3 AI accountability platform built for the Monad Blitz Mumbai hackathon. Users set personal challenges and stake monad crypto via smart contracts Others can bet on outcomes. AI tracks progress and sends Telegram nudges. Winners share the pot; quitters lose their stake. Built with Next.js, Privy auth, Supabase, and Solidity on Monad.",
            "team_members": "none",
            "github_url": "https://github.com/sailorworks/monad-blitz-mumbai",
            "demo_url": "https://github.com/sailorworks/monad-blitz-mumbai",
            "category": "consumer betting",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-sahilprasadroxxxx11@gmail.com-1771765421659.png",
            "submitted_at": "2026-02-22T13:03:43.945079+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "5e484877-2c24-4718-aeca-006040b313d1",
            "title": "Scourge",
            "description": "Scourge is a privacy-first data marketplace built on Monad where individuals monetize their real behavioural data, bank statements, UPI spend, fitness metrics, telecom usage without ever exposing raw information. Users register with a soul bound identity NFT (verified via ZK proofs to prevent sybils), then browse campaigns posted by companies seeking specific demographic attributes. When a user submits data, Circom circuits generate Groth16 zero-knowledge proofs that verify constraints (age range, region, spend thresholds) on-chain without revealing the underlying values. Data is encrypted client-side and stored on IPFS; the decryption key is released atomically through an escrow contract only after proof verification succeeds, triggering instant trustless payment no manual approval, no usefulness gate, no middlemen. Companies get verified, attributed data insights; users keep full privacy and earn crypto. The entire pipeline identity registration, campaign creation, proof verification, escrow release is handled by on-chain Solidity contracts with a Next.js frontend.",
            "team_members": "Harshad Saha, Utkarsh Mani Tripathi",
            "github_url": "https://github.com/HarshadS7/Scourge",
            "demo_url": "https://github.com/HarshadS7/Scourge",
            "category": "DePIN (Decentralised Physical infrastructure Networks)",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-harshadsaha7@gmail.com-1771765230871.png",
            "submitted_at": "2026-02-22T13:00:31.307953+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "6b882c9b-81a7-4ebe-94f4-f1ac9015bc95",
            "title": "Mon-O-Poly",
            "description": "A prediction market scroller for doom scrollers",
            "team_members": "Rajdeepsinh Jadeja",
            "github_url": "https://github.com/TheRealRajdeep/monkinator-2/tree/main/mon-o-poly%20V2",
            "demo_url": "https://github.com/TheRealRajdeep/monkinator-2/tree/main/mon-o-poly%20V2",
            "category": "DeFi",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-rajdeepjadeja2806@gmail.com-1771765228008.png",
            "submitted_at": "2026-02-22T13:00:29.229184+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "ff9fd9a2-1bb0-458e-b8c3-f478f17f94b9",
            "title": "BitzzBond",
            "description": "BlitzzBond is a decentralized financial primitive built on the Monad Testnet that enables users to create and redeem secure, password protected crypto bonds without requiring the recipient’s wallet address in advance.\r\nTraditional crypto transfers require wallet address exchange, gas fee awareness, and technical blockchain knowledge. This creates friction in onboarding, reward distribution, and conditional payments.\r\nBlitzzBond introduces a secret-based redemption model that transforms wallet-to-wallet transfers into secure secret-to-value transfers.",
            "team_members": "Deven Sawant, Rudraksh Zodage",
            "github_url": "https://github.com/d-even/kohioor/",
            "demo_url": "https://crypto-bond-eight.vercel.app/",
            "category": "DeFi",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-devensawant4554@gmail.com-1771765225157.png",
            "submitted_at": "2026-02-22T13:00:25.90723+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "76993c73-9d6b-4e4b-8687-916fb4004b72",
            "title": "PrivatePay",
            "description": "The first on-chain untraceable, unidentifiable, private payments on Monad.\r\nPowered by Elliptic Curve Diffie-Hellman (ECDH) + secp256k1 + BIP 0352 / EIP 5564 + ROFL DarkPool Mixer\r\n\r\nSimply means “Users can Send Stealth Crypto Payments using multilayer forks”\r\n\r\nFinancial Privacy inside Blockchain is broken,\r\n- Bitcoin and Crypto’s primary agenda was Privacy and Private Payments\r\n- Due to the birth of Arkham Intelligence, Dune Analytics and similar platforms\r\n- Payments on Public Blockchains Are Not Private Anymore\r\n- They are Traceable, Trackable, Identifiable\r\nThis is causing fear, inconvenience and results in financial loss due to targeted attacks on wallets\r\n\r\nLet’s understand with 1/infinite examples via a Real Life Story:\r\nAlice, a legendary dev Won Monad Pune Hackathon $700 prize money\r\n- Bob a dev was also participating and won the hack but his co-founder was not trustable and refused to say receiving any money from hack\r\n- Bob texted all 3 winners asking the wallet address of the organizer who sent the prize money, 1 of the winners shared the address and on explorer it was identifiable to find which person received what.\r\n- Now, Bob used the logic to identify $1500 was distributed among 3 winners and just by spending a couple of minutes and utilising some intelligence tools he was able to identify each and every wallet belonged to whom.\r\n- This was serious concern to each and every participant as nobody would ever like to show up the wallet where their entire money is kept and Bob can target this people for his benefit.\r\n\r\nSolution - PrivatePay:\r\nWhere every transaction is fully private, anon. unidentifiable and untrackable \r\nWhether user sending money or receiving money their wallet are never linked\r\nInfinite Untraceable Stealth Accounts, Infinite txns, Infinite mixers and One Single DarkPool\r\nShare a single payment link\r\nEach payment generates a fresh stealth sub-account\r\nSender cannot identify receiver\r\nReceiver cannot identify sender\r\nObservers see nothing linkable\r\nLike Stripe links but every transaction is a new, invisible wallet.\r\n\r\n⚡Future\r\n- Endless possibilities anything to everything related to payments\r\n- Expanding to Private Credit and Debit Cards Payments\r\n- Private Cross Chain Bridges\r\n- Disposable Wallets\r\n- Hedge Fund Money Moves\r\nNo more James Waynn Exposer and End to HyperLiquid Reveals",
            "team_members": "Amaan Sayyad",
            "github_url": "https://github.com/AmaanSayyad/PrivatePay-Monad",
            "demo_url": "https://private-pay-monad.vercel.app/",
            "category": "Payments",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-amaansayyad2001@gmail.com-1771765221343.svg",
            "submitted_at": "2026-02-22T13:00:21.912706+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "406900bc-78c7-49d8-b130-d60a24c7784f",
            "title": "Quiz Blitz",
            "description": "Category Bomb Arena is a fast-paced, multiplayer elimination word game built on Next.js with a Bun + Hono backend and integrated with Monad Testnet for onchain predictions and staking. Players take turns submitting valid answers within a given category under a shrinking timer, while dynamic constraints such as banned letters, blitz speed rounds, and instant category switches increase tension throughout the match. The backend acts as the authoritative game engine, enforcing timers and validation rules, while smart contracts handle prediction recording and reward settlement. The project combines real-time gameplay with decentralized prediction mechanics to create a competitive, social, and replayable experience optimized for Web3-native users.",
            "team_members": "Shaurya Kesarwani, Leander Fernandes, Soha Khare",
            "github_url": "https://github.com/ShauryaKesarwani/monad-quiz-blitz",
            "demo_url": "https://github.com/ShauryaKesarwani/monad-quiz-blitz",
            "category": "Gaming",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-sohaajaykhare2006@gmail.com-1771765202330.jpeg",
            "submitted_at": "2026-02-22T13:00:03.022621+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "110e9522-8dc6-458d-bcd9-dd5bd059bca1",
            "title": "Promptfi",
            "description": "Market Place To buy Ai prompts Using NFTs",
            "team_members": "Ashish Parab Malhar Gandre Sohan Vichave",
            "github_url": "https://github.com/Malhar1801/monad-blitz-mumbai",
            "demo_url": "https://monad-blitz-mumbai-wy9d.vercel.app/",
            "category": "NFT",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-malhargandre@gmail.com-1771765180776.png",
            "submitted_at": "2026-02-22T12:59:41.360949+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "2d7cce0b-1dab-4a1d-be78-068dcbee8800",
            "title": "Pager",
            "description": "Pager is a location‑based bounty network where anyone can post a crypto reward to verify real‑world events & queries in form of bounties, and local users earn by providing on the ground proof.\r\n\r\nThink:\r\n\r\n“I heard a building collapsed in NYC, is it true? Show me.”\r\n“Is that rockstar actually performing at this venue right now?”\r\n“Is the vadapav guy still at the same corner in Vapi?”\r\n\r\nRemote users post a bounty + question + location; locals nearby respond with text + photos/videos + GPS proof and get paid in USDC on Monad testnet when the bounty creator accepts their answer.",
            "team_members": "Koushik Nageshwar, Arudra Gamidi",
            "github_url": "https://github.com/Koushik1244/Pager",
            "demo_url": "https://pager-b6fd474918e6.herokuapp.com/",
            "category": "Social",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-nageshwaraman111@gmail.com-1771765170877.png",
            "submitted_at": "2026-02-22T12:59:31.865441+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "ee067f50-b8e3-42d9-8911-5eee82df90f6",
            "title": "Monadfluence",
            "description": "Monadfluence is a openclaw-first AI influencer backend built on the Monad testnet, designed to create, manage, and monetize fully autonomous digital creators. Unlike typical AI content tools that rely on human prompts and manual workflows, Monadfluence operates as a coordinated multi-agent system",
            "team_members": "Abhishek Tiwari, Ayush Srivastava",
            "github_url": "https://github.com/ayushsrivastava55/monadfluence/",
            "demo_url": "https://monadfluence.vercel.app",
            "category": "Consumer Application",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-ayushsrivas55@gmail.com-1771765153932.png",
            "submitted_at": "2026-02-22T12:59:15.370469+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "743571a8-7a96-4c5e-808c-b144e1b724a8",
            "title": "Senkyou",
            "description": "only pay for what you learn",
            "team_members": "Aviral Jain",
            "github_url": "https://github.com/0x-avi/senkyou",
            "demo_url": "https://senkyou-frontend-n9iekrq5y-plasmiczs-projects.vercel.app",
            "category": "DeFi",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-aviralkamaljain@gmail.com-1771765154484.png",
            "submitted_at": "2026-02-22T12:59:15.208515+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "8279af3d-d45f-48c4-9352-19ade3e8e46e",
            "title": "sentinel Guard",
            "description": "SentinelGuard is a real-time smart contract security oracle for Monad.",
            "team_members": "Rohan Doke, Ameya Barapatre, Rahul Aitla",
            "github_url": "https://github.com/Rohan-R-D/sentinelguard",
            "demo_url": "https://github.com/Rohan-R-D/sentinelguard",
            "category": "Security",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-aitlarahul@gmail.com-1771765144336.png",
            "submitted_at": "2026-02-22T12:59:05.300948+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "c4e00bfc-fa76-486a-bfda-8924b044c20f",
            "title": "Predictx",
            "description": "**PredictX** is an open-source decentralized prediction market platform built for the Monad Testnet  that allows users to create, trade, and resolve YES/NO markets on real-world events using a constant-product AMM smart contract system written in Solidity with Foundry. The project combines , Privy embedded wallet integration, a Python FastAPI backend supporting the x402 micropayments protocol, and Twitter/X Blink browser extension functionality to enable seamless on-chain trading directly from social feeds. Users can create markets, buy and sell outcome shares, vote on resolutions, and claim winnings, with optional oracle integrations for outcome verification, all designed to leverage Monad’s high-speed, low-fee infrastructure while maintaining a fully decentralized and community-driven market mechanism.",
            "team_members": "Parth Kk",
            "github_url": "https://github.com/Beastdzns/predictx",
            "demo_url": "https://youtu.be/-jxN4Er6RKk",
            "category": "DeFi , Payments",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-shlokkhairnar333@gmail.com-1771765126064.png",
            "submitted_at": "2026-02-22T12:58:46.921132+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "f1e910c8-d045-49ec-bc76-58834d0ecdbc",
            "title": "DeFi Copilot",
            "description": "DeFi Copilot\r\nAI-powered autonomous yield optimizer built on Monad Testnet.\r\n\r\nYou deposit tokens into a smart contract vault, set your risk tolerance, and an AI agent automatically moves your funds between DeFi protocols to chase the best yield — without you lifting a finger.",
            "team_members": "Soham Sawant  Mehetab Ali  Ketan Chavan",
            "github_url": "https://github.com/Ketan2605chavan/monad-blitz-mumbai",
            "demo_url": "https://github.com/Ketan2605chavan/monad-blitz-mumbai",
            "category": "DeFi",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-ketanp2605@gmail.com-1771765109145.jpg",
            "submitted_at": "2026-02-22T12:58:30.082561+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "a8640242-2fdc-4874-ac3b-34d4af7d6fac",
            "title": "Aawaazz",
            "description": "Aawaaz is a privacy-first decentralized platform designed to protect investigative journalists while restoring ownership, safety, and independence in modern journalism.\r\n\r\nJournalists reporting on corruption, organized crime, war zones, financial fraud, and political misconduct often face surveillance, censorship, threats, and even assassination. Traditional publishing systems expose their identities and place editorial control in centralized institutions, leaving reporters vulnerable and undercompensated.\r\n\r\nAawaaz solves this by leveraging blockchain, decentralized identity, and zero-knowledge technology to create a secure reporting infrastructure.",
            "team_members": "Shivam Tiwari, Vishal Tiwari, Devesh Tiwari",
            "github_url": "https://github.com/tiwarishivam-pixel/Aawaaz",
            "demo_url": "https://github.com/tiwarishivam-pixel/Aawaaz",
            "category": "Security,privacy",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-shivam810414@gmail.com-1771765105222.png",
            "submitted_at": "2026-02-22T12:58:25.696988+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "2d436120-eabc-4557-b6ef-ff5e0642f4f1",
            "title": "AgriFi",
            "description": "AgriFi is an on-chain micro‑lending protocol built on the Monad Testnet that connects farmers directly with lenders. Farmers can request seasonal, crop-based loans, and lenders can fund them in a transparent, peer-to-peer manner. Repayments are aligned with harvest cycles and enforced by smart contracts.\r\n\r\nEach successful repayment mints a Credit NFT, creating a permanent, verifiable on-chain credit history for the farmer. Over time, this builds a programmable credit score, enabling greater financial trust without intermediaries.\r\n\r\nAgriFi transforms harvest success into portable, blockchain-based rural trust.",
            "team_members": "Bhavya Soni, Dhairya Shah",
            "github_url": "https://github.com/BhavyaSoni21/DB-Copper_Monad-Blitz-Project_AgriFi.git",
            "demo_url": "https://db-copper-monad-blitz-project-agri.vercel.app/",
            "category": "DeFi",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-bhavyasoni0135@gmail.com-1771765096030.png",
            "submitted_at": "2026-02-22T12:58:16.951538+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "882bc3b5-e289-4b5f-8d75-d69bf82401b2",
            "title": "MonoLeague",
            "description": "Create your own team on MonoLeague and earn rewards using ML models that predict which players will perform best for your squad.",
            "team_members": "Yash Baing",
            "github_url": "https://github.com/yashbaing/MonoLeague",
            "demo_url": "https://mono-league.vercel.app/",
            "category": "DeFi",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-yashbaing07@gmail.com-1771765091083.png",
            "submitted_at": "2026-02-22T12:58:12.068815+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "4361239e-f234-4032-8820-4914cf01c4a4",
            "title": "VyseForge",
            "description": "VybeForge is a multi-agent AI-powered blockchain development platform where a user describes a blockchain project idea in plain English and the system automatically builds, tests and tells you hoe to deploy a fully working DApp.",
            "team_members": "Rupayan Paul, Sahil Kolte",
            "github_url": "https://github.com/Nishad-30/vyseForge",
            "demo_url": "https://vyseforge-pridhidofgq8jhqtrykxhz.streamlit.app/",
            "category": "AI Agents, Developer Tooling, DeFi, NFT, DApp",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-nishaddsutar42203@gmail.com-1771765084014.png",
            "submitted_at": "2026-02-22T12:58:04.664095+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "9344c1b6-7267-4887-aa8e-a679b8971623",
            "title": "stakeHUB",
            "description": "stakeHUB is a high-performance social speculation layer that transforms passive social engagement into financial conviction. Built to leverage Monad's parallel execution and 0.4s block times, stakeHUB allows creators to launch \"Arenas\" parimutuel staking pots where followers back real world outcomes or personal challenges.\r\n\r\nWhat makes it special:\r\nLudicrous Speed: A specialized BFF (Backend-for-Frontend) architecture with a 400ms polling indexer ensures that \"Live Odds\" shift the instant a stake lands, mimicking Web2 snappiness.\r\nSocial-First Identity: Deeply integrated with the Farcaster social graph (Warpcast Mini App) so your \"Alpha Reputation\" is portable and verifiable across the ecosystem.\r\nMonad-Native Parallelism: By using a modular Factory pattern, thousands of independent Arenas can be staked on simultaneously without state contention, fully utilizing Monad's Parallel EVM.\r\nProduction-Ready Security: Implements a \"Pull-over-Push\" payout pattern and UUPS upgradeable contracts to ensure safe, scalable distributions for thousands of winners.",
            "team_members": "Saish Korgaonkar",
            "github_url": "https://github.com/SaishKorgaonkar/stakeHUB",
            "demo_url": "https://github.com/SaishKorgaonkar/stakeHUB",
            "category": "SocialFI",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-saishkorgaonkar14@gmail.com-1771765028637.png",
            "submitted_at": "2026-02-22T12:57:09.633271+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "bf926acd-502e-4d83-a2b9-4a5e09cf3670",
            "title": "ProofPulse",
            "description": "Today, your reputation lives inside platforms.\r\n\r\nLinkedIn owns your credibility.\r\nGitHub owns your contributions.\r\nTwitter owns your influence.\r\n\r\nProofPulse reimagines trust as wallet-native.\r\n\r\nBuilt on Monad, it enables builders to endorse each other with weighted credibility signals, creating a portable, verifiable, on-chain reputation layer that travels with your wallet — not with a platform.\r\n\r\nWe believe the next generation of the internet needs open credibility infrastructure.\r\n\r\nProofPulse is a step toward that future.",
            "team_members": "Ayush Sahu, Vaibhav Sapaliya, Prayas Pandey",
            "github_url": "https://github.com/Ayush2649/monad-blitz-Hackathon.git",
            "demo_url": "https://monad-two.vercel.app/",
            "category": "dApp",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-ayush.sahu@contentstack.com-1771764927684.png",
            "submitted_at": "2026-02-22T12:55:29.219236+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "7385bf73-58b1-4134-bda4-45af0461225d",
            "title": "PokeBattle",
            "description": "Description:\r\n\r\nPokeBattle is a fully on-chain Top-Trumps style trading card game built on Monad Testnet. Players collect Pokémon NFT cards and battle each other in real-time PvP matches where the winner claims the loser's staked card.\r\n\r\nKey Features:\r\n\r\nTrue NFT Ownership: Every card is an ERC-721 NFT on Monad. Cards have unique tiers (Common, Uncommon, Rare, Epic, Legendary) with different stats and rarity.\r\n\r\nMultiple Ways to Collect: New players get a free starter Pikachu, everyone can claim a random card every 24 hours, and premium cards can be purchased with MON tokens directly on-chain.\r\n\r\nReal-time PvP Battles: Create or join private battle rooms using 4-digit codes. Both players stake a card, take turns choosing Attack/Power/Defense moves, and fight until one Pokémon's HP reaches zero. The winner takes the opponent's card.\r\n\r\nOn-chain Transactions: Card purchases are processed through smart contracts on Monad Testnet. MON tokens are spent to mint premium NFT cards with verifiable ownership.\r\n\r\nUser Profiles: Players create usernames after connecting their wallet, displayed throughout the app and in battles.\r\n\r\nTech Stack:\r\n\r\nFrontend: Next.js 14, React, TailwindCSS with Neo-Brutalist design\r\nBlockchain: Monad Testnet (EVM-compatible, high-throughput)\r\nSmart Contracts: Solidity (ERC-721 with custom minting tiers)\r\nReal-time Multiplayer: Supabase with PostgreSQL and real-time subscriptions\r\nWallet Integration: RainbowKit + wagmi",
            "team_members": "Shubham Gupta,Om Telgade,Aryan Yadav",
            "github_url": "https://github.com/ShubhZ06/monad-blitz-mumbai",
            "demo_url": "https://pokeball-shubham.vercel.app/",
            "category": "NFT GAME",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-shubhamgupta73110@gmail.com-1771764900832.png",
            "submitted_at": "2026-02-22T12:55:01.303462+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "b6fb751f-bd26-497f-b29e-62b7b5eada4d",
            "title": "SentimentFi",
            "description": "Optimizing tool selection...SentimentFi is an AI-powered onchain sentiment oracle built for Monad. It fetches live crypto “signal” text from Reddit and open news RSS sources, then runs a HuggingFace sentiment model to classify each headline/post as bullish or bearish. The results are aggregated into a normalized score between -1.0 and +1.0, showing overall market mood for tokens like MONAD, BTC, and ETH. With one click, the score is written on Monad Testnet to a deployed SentimentOracle smart contract, enabling transparent, verifiable sentiment data for DeFi apps, dashboards, and trading strategies.",
            "team_members": "Pushkar Shelar",
            "github_url": "https://github.com/pushkar-shelar/Sentiment-Fi",
            "demo_url": "https://sentimentfi-i9yw2h6mdisnyvyxm95skw.streamlit.app/",
            "category": "Oracle Infrastructure",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-pushkarshelar1@gmail.com-1771764853684.png",
            "submitted_at": "2026-02-22T12:54:14.399281+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "a06d42ec-a52d-46ca-ab78-2aa6671131d5",
            "title": "MonQuest",
            "description": "MonQuest is an on-chain marketplace for digital bounties built on Monad. It lets users post technical tasks, submit work, and receive instant blockchain-based rewards. With wallet identity, AI-assisted validation, and transparent settlement, MonQuest makes Web3 collaboration fast, trustless, and rewarding.",
            "team_members": "Aashish Choudhary , Yuvraj Singh , Tarun Karn",
            "github_url": "https://github.com/freakyyirus/MonQuest",
            "demo_url": "https://monquest.vercel.app",
            "category": "DeFi, Developer Tooling",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-ashishcyofficial@gmail.com-1771764840495.png",
            "submitted_at": "2026-02-22T12:54:00.967634+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "88001872-4b71-4a15-a48a-5cf990dd512d",
            "title": "PaintBlitz",
            "description": "PaintBlitz is a fast-paced, skill-based multiplayer game built entirely onchain for Monad Blitz.\r\n\r\nPlayers stake MON to enter a match, then compete in real time by answering questions correctly to paint cells on a shared grid. Each correct answer lets a player claim territory, and when the timer ends, the player controlling the most cells wins the entire prize pool.\r\n\r\nUnlike luck-based or RNG-driven games, PaintBlitz is designed so that knowledge and speed determine the outcome. There is no randomness, no farming, and no passive earning — only active, competitive play.\r\n\r\nThe game is optimized for high-frequency onchain interactions. Gameplay actions are signed using a session-based wallet to avoid repeated wallet popups, enabling smooth, Web2-like interaction while remaining fully onchain. High-value actions such as staking, joining games, and payouts are secured through MetaMask.\r\n\r\nPaintBlitz naturally benefits from Monad’s optimistic parallel execution, as multiple players can perform gameplay actions concurrently without sacrificing correctness or user experience. This makes real-time multiplayer gameplay practical and responsive onchain.\r\n\r\nPaintBlitz demonstrates how consumer-friendly, competitive games can be built on Monad by combining fast execution, clean UX, and fully verifiable onchain logic.",
            "team_members": "Khushi Chaudhary, Chirag Dulera, Praniti Kubal",
            "github_url": "https://github.com/Chirag1522/monad-paintBlitz",
            "demo_url": "https://monad-paint-blitz.vercel.app/",
            "category": "Onchain Games / Consumer dApps",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-khushigchaudhary@gmail.com-1771764800540.jpeg",
            "submitted_at": "2026-02-22T12:53:21.188993+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "2a08a358-31b1-4f18-9c63-f822cecc733d",
            "title": "MicroWork",
            "description": "MicroWork — Instant Gig Payments & Reputation-Backed Credit for India's Informal Economy\r\nThe Problem\r\nIndia has 450 million informal and gig workers — delivery riders, domestic workers, daily wage laborers, and freelancers. They face three brutal realities that have gone unsolved for decades: platforms hold earnings for 7–14 days before settling, take 20–30% cuts with zero transparency, and leave workers with no verifiable work history — making them invisible to banks, lenders, and financial institutions entirely.\r\nWhat We Built\r\nMicroWork is an on-chain gig payment platform where clients post jobs with payment locked in a smart contract escrow, workers accept and complete jobs, and payment releases instantly the moment both parties confirm — no platform intermediary, no delays, no hidden fees.\r\nEvery completed job automatically mints a soulbound Reputation NFT to the worker. This creates a permanent, portable, tamper-proof work history that the worker owns — not the platform. A domestic worker with 20 verified on-chain jobs carries that record everywhere, forever.\r\nThe most novel part: workers with 5+ verified jobs can borrow against their reputation instantly through our MicroLoan contract. No bank. No CIBIL score. No credit history. Just proof of work — a DeFi primitive that has never been applied to the informal labor market before.\r\nWhy Monad Makes This Real\r\nOn Ethereum mainnet, a ₹500 ($6) gig payment costs more in gas than the worker earns. On Monad, it costs fractions of a cent. This isn't a technical footnote — it's the entire reason this product can exist. Sub-second finality means workers get paid the instant a job is done, not end-of-week. 10,000 TPS means thousands of workers completing tasks simultaneously with zero congestion.\r\nThis is economically impossible on any other chain. On Monad, it's trivial.\r\nContracts Deployed on Monad Testnet\r\nThree contracts working together as a complete system: MicroWorkEscrow handles job posting, worker matching, and dual-confirmation payment release. ReputationNFT mints soulbound ERC-721 tokens for every verified job — non-transferable, permanently on-chain. MicroLoan is a reputation-backed micro-lending pool where job history is the only collateral required.\r\nThe Bigger Vision\r\nThis is financial infrastructure for people who have been locked out of it. A gig worker building an on-chain reputation today is building a credit identity for tomorrow — one that no platform can take away, no bank can gatekeep, and no border can block. MicroWork is the first step toward a parallel financial system for the informal economy, built on verifiable work rather than financial history.",
            "team_members": "Ujjwal Dubey",
            "github_url": "https://github.com/ujjwaldubey1/monad-blitz-mumbai",
            "demo_url": "https://microwork-three.vercel.app/",
            "category": "DeFi",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-ujjwal07dubey@gmail.com-1771764726340.png",
            "submitted_at": "2026-02-22T12:52:07.225915+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "8f150094-985d-4d1e-8554-f34f15d134e1",
            "title": "STRIDE",
            "description": "STRIDE is a zero-sum on-chain fitness accountability protocol built on Monad Testnet, where participants stake crypto to commit to a step goal. Winners split the losers' stakes, losers fund the disciplined.",
            "team_members": "Vedant Sonje and Sarthak Pawar",
            "github_url": "https://github.com/OdinSlayer429/monad-blitz-mumbai-STRIDE",
            "demo_url": "https://frontend-nine-murex-91.vercel.app/",
            "category": "Consumer DApp",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-vedantsonje1513@gmail.com-1771764707761.jpeg",
            "submitted_at": "2026-02-22T12:51:48.484266+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "65013eaf-9ba8-4531-a6db-36facbd27419",
            "title": "Lattice press",
            "description": "LatticePress is a zero-copy transaction compression protocol for the Monad blockchain. At 10,000 TPS, Monad accumulates ~16.76 GB/hr of state bloat. LatticePress tackles this with a two-layer pipeline: a Rust sidecar intercepts transactions off-chain, replacing 4-byte function selectors with 1-byte dictionary IDs and applying Zstd compression. On-chain, a Yul-optimized gateway contract decompresses payloads directly in EVM memory and executes them via delegatecall — with zero storage reads. This achieves up to 75% payload reduction, shrinking hourly bloat to ~4.19 GB at negligible gas overhead (~240 gas).",
            "team_members": "Bhoumik Sangle, Kritarth Shankar",
            "github_url": "https://github.com/happypeepo/MND-Protocol",
            "demo_url": "https://github.com/happypeepo/MND-Protocol",
            "category": "Infra",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-bhoumiksangle@gmail.com-1771764695830.png",
            "submitted_at": "2026-02-22T12:51:36.867861+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "835adc82-2f1b-4dd8-90e6-7cd99024d86c",
            "title": "RoastArena",
            "description": "RoastArena is the ultimate \"Roast-to-Earn\" playground built on the blazing-fast Monad Testnet. It introduces a highly engaging real-time social betting platform where users can stake MON tokens on \"baits\" (posts) and \"roasts\" (comments) across intense gladiator-style Arenas. \r\n\r\nWhat it does: \r\nUsers can step into the arena by creating new target subjects with an initial stake. Gladiators (participants) drop their most savage roasts while voters back their favorite roasts with actual crypto stakes. Once the arena settles, smart contracts automatically distribute the payout pools rewarding both the best roasters and early voters.\r\n\r\nWhat makes it special: \r\n1. 100% On-Chain Settlement: Built on Monad Testnet, utilizing Monad’s rapid 1-second block times for instantaneous and fully transparent stake management.\r\n2. Custom EVM Polling Engine: We bypassed standard RPC limitations by writing a heavily optimized Node.js background worker combined with Turso DB, ensuring zero-latency mirroring of Monad events.\r\n3. Fluid UX: Powered by a Next.js frontend, creating a Web2-level smooth experience with fully reactive real-time activity feeds, seamless wallet integration, and dynamic leaderboards.",
            "team_members": "Duvesh Punjabi , Sankalp Pandey , Omkar Saroj",
            "github_url": "https://github.com/sankalp771/MONAD_RAGE",
            "demo_url": "https://roast-on-chain.vercel.app/",
            "category": "SocialFi / Web3 Gaming",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-sankalpiit15@gmail.com-1771764606049.jpeg",
            "submitted_at": "2026-02-22T12:50:06.724913+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "5236182e-aca9-4c01-b831-a1d019dfe665",
            "title": "Monad-ID",
            "description": "MonadID is a privacy-preserving identity layer that lets users prove they are real humans without revealing any personal data.",
            "team_members": "Satyam Sharma, Shreyas Thakur",
            "github_url": "https://github.com/SatyamDev803/monad-id",
            "demo_url": "https://github.com/SatyamDev803/monad-id",
            "category": "Consumer, Privacy",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-sharmasatyam1603@gmail.com-1771764562787.png",
            "submitted_at": "2026-02-22T12:49:23.768598+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "334801f4-a46b-4a33-b78a-37fe1c5e0dc6",
            "title": "Monad Whale Platform",
            "description": "**Monad Whale Intelligence** is a real-time blockchain analytics dashboard that connects to the Monad testnet via ethers.js to track whale transfers, smart money wallets, DEX swaps, and newly deployed tokens. It streams simulated on-chain events through Server-Sent Events, lets users set custom alert rules with configurable thresholds, and provides a wallet watchlist for monitoring specific addresses -- all inside a dark-themed Next.js app built with shadcn/ui and Recharts.",
            "team_members": "Sairam Ravirala , Pratik Devarmani",
            "github_url": "https://github.com/Sairamravirala/monad-blitz-mumbai",
            "demo_url": "https://v0-monad-whale-platform.vercel.app/",
            "category": "Social Signals for Degens",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-sairamravirala26@gmail.com-1771764448453.png",
            "submitted_at": "2026-02-22T12:47:29.230028+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "29d5ea63-daf0-44a1-8263-906b61114ffb",
            "title": "Monarch",
            "description": "Live Stream Prediction Market",
            "team_members": "Atharv More",
            "github_url": "https://github.com/inline-arc/Monarch101",
            "demo_url": "https://github.com/inline-arc/Monarch101",
            "category": "Prediction Market",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-atharvmore37@gmail.com-1771764356982.png",
            "submitted_at": "2026-02-22T12:45:57.487456+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "d6dda2fd-f0e5-46d9-b8a4-f201ffd4a3e1",
            "title": "ClankerKit",
            "description": "An agent-agnostic SDK that gives any AI agent (OpenClaw, LangChain, CrewAI, custom) autonomous financial capabilities with built-in guardrails — staking, swaps, transfers, and policy enforcement.",
            "team_members": "Wahid Shaikh, Shishir Shetty",
            "github_url": "https://github.com/0xsoydev/monowire-blitz/tree/clankerkit",
            "demo_url": "https://github.com/0xsoydev/monowire-blitz/tree/clankerkit",
            "category": "AI Agents, Payments, DeFi, Agentic Payments",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-shishirshetty26@gmail.com-1771764263431.png",
            "submitted_at": "2026-02-22T12:44:24.176443+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "2ff85810-eec6-4e64-ab70-a8c7255b54a4",
            "title": "PredBlinks",
            "description": "PredBlinks is a binary prediction market protocol that enables real-time forecasting of creator growth, token performance, and on-chain metrics directly within the Twitter/X interface.\r\n\r\nBuilt on Monad and powered by Blinks, PredBlinks allows users to participate in structured prediction markets without leaving the social platform. Markets can be created around measurable outcomes such as follower milestones, engagement thresholds, token price targets, TVL benchmarks, trading volume, and other verifiable public metrics.\r\n\r\nBy embedding prediction functionality natively into social feeds, PredBlinks transforms opinions into measurable positions. Community members can back creators they believe in, analysts can express token theses in a transparent way, and projects gain access to real-time sentiment signals backed by economic commitment rather than passive engagement.\r\n\r\nThe platform leverages Monad’s high-performance execution to enable fast settlement, low latency interactions, and scalable micro-markets suitable for social-driven use cases.\r\n\r\nPredBlinks bridges social media, creator economies, and crypto-native financial primitives—creating a seamless environment where conviction, community, and capital converge",
            "team_members": "Sneha gupta",
            "github_url": "https://github.com/snehaa-eth/monad-blitz-mumbai",
            "demo_url": "https://monad-blitz-mumbai-gamma.vercel.app/",
            "category": "Prediction Markets-Consumer Apps",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-snehagupta98930@gmail.com-1771764110578.jpeg",
            "submitted_at": "2026-02-22T12:41:51.519742+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "02154389-76dc-4da7-9c41-5825a44b7f24",
            "title": "Split-on-monad",
            "description": "MonadSplit is a decentralized expense-splitting app built on Monad Testnet that eliminates the awkwardness of shared expenses between friends.\r\n\r\nInstead of relying on social trust and manual follow-ups, MonadSplit writes every expense directly to the blockchain - permanently, publicly, and mathematically undeniable. Groups are individual smart contracts. Balances update on-chain in real time. Settlement is a direct peer-to-peer MON transfer, not a promise.\r\n\r\nKey Features:\r\n>Connect any EVM wallet (MetaMask, RainbowKit) - no signup\r\n>Create expense groups where each group is its own on-chain smart contract\r\n>Log shared expenses - costs are split equally and recorded immutably\r\n>Real-time balance dashboard showing exactly who owes whom\r\n>Settle debts by sending MON tokens directly, wallet-to-wallet\r\n>Fully trustless - no backend, no database, no middleman\r\n\r\nWhy Monad: Fast finality and low fees make micro-settlements ($5 pizza split) economically viable - something impossible on high-fee chains.",
            "team_members": "Rakesh Kumawat (Solo)",
            "github_url": "https://github.com/rakeshkumawat12/split-on-monad",
            "demo_url": "https://split-on-monad.vercel.app/",
            "category": "DeFi / Consumer dApp",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-rakeshkumawatrrkk12877@gmail.com-1771764099090.png",
            "submitted_at": "2026-02-22T12:41:40.567547+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "a9f2f53b-cdb1-41f2-a379-cd208eccbbfc",
            "title": "BATTLE BLITZ",
            "description": "Battle Blitz appears to be a Web3 gaming platform or a Play-to-Earn (P2E) game. While the specific Vercel URL you provided is a deployment link (often used for testing or early-access web apps), the project itself is a tactical strategy game.\r\n\r\nKey features typically associated with this project include:\r\n\r\nHero-Based Combat: Players take on the role of a \"BattleMaster,\" leading squads of heroes with unique attributes (Armor, Health, Movement, Weapons).\r\n\r\nDeck Building: It utilizes a collectible card game mechanic where players craft decks to outsmart opponents.\r\n\r\nHybrid Gameplay: It often blends physical tabletop elements (like QR-enabled cards) with a digital interface for lore, authentication, and gameplay stats.\r\n\r\nFaction System: Players choose from different factions (such as those based on the lore of a planet called Antioch) to define their playstyle.",
            "team_members": "Shreyash Vishwakarma",
            "github_url": "https://github.com/ShreyashGitHubb/battel-blitz",
            "demo_url": "https://battel-blitz.vercel.app",
            "category": "GameFi, NFT, P2E",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-shreyasvishwakarma00@gmail.com-1771764064035.png",
            "submitted_at": "2026-02-22T12:41:04.747691+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "d80eb7ff-5c99-4480-a4a9-6b2f1b63b4d6",
            "title": "CircleTrust - Decentralized Rotating Savings Pool",
            "description": "CircleTrust is a decentralized ROSCA (Rotating Savings and Credit Association) platform built on Monad Testnet. Users create or join savings pools where members contribute regular amounts and take turns receiving collective payouts. Smart contracts enforce contributions through collateral deposits (2x contribution amount) and maintain an on-chain reputation system (+1 point for pool completion, -2 points for defaults). Time-based automation with round deadlines ensures trustless operation without relying on social pressure, making it ideal for group savings, microfinance, and financial inclusion. Built with Solidity smart contracts and a Next.js frontend.",
            "team_members": "Yashica Thanekar",
            "github_url": "https://github.com/codesbysuraj/monad-blitz-mumbai-CircleTrust",
            "demo_url": "https://circletrust.vercel.app/",
            "category": "Defi",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-surajy.tech@gmail.com-1771763995916.png",
            "submitted_at": "2026-02-22T12:39:56.726286+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "5daf65f8-4622-4128-88c0-9ab32d634113",
            "title": "State Clash",
            "description": "⚡ State Clash: Visualizing Monad's Parallel EVM\r\nBuilt for the Monad Blitz Mumbai Hackathon\r\n\r\nState Clash is a massive, real-time multiplayer 50x50 collaborative pixel canvas built to dynamically visualize the core innovation behind Monad: Optimistic Parallel Execution.\r\n\r\nInstead of building another DEX to show that Monad is \"fast,\" State Clash uses thousands of concurrent micro-transactions to turn the Parallel EVM into an interactive, visually stunning multiplayer game.",
            "team_members": "Lokesh",
            "github_url": "https://github.com/lokesh-katari/monad-blitz-mumbai/tree/main/StateClash/state-clash",
            "demo_url": "https://state-clash.vercel.app/",
            "category": "Ecosystem Public Good / Web3 Education",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-lokeshkatari921@gmail.com-1771763987581.png",
            "submitted_at": "2026-02-22T12:39:48.336458+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        },
        {
            "id": "0abf0045-2044-402c-a14d-59b18e1c7d95",
            "title": "MEMEWARS",
            "description": "MemeWars is a full-stack decentralized application (dApp) that simulates a high-stakes trading environment. It features 5 distinct AI agents (Sniper, Holder, Degen, CopyTrader, and Whale) competing for dominance in a volatile market. Every action is a real transaction on the **Monad Testnet**, making it a live visual stress test for the network while leveraging the advantage of 10000 TPS by monad.",
            "team_members": "Misbah Ansari",
            "github_url": "https://github.com/Aditya-linux/memewars",
            "demo_url": "https://example-production-9b35.up.railway.app/",
            "category": "GameFi",
            "image_url": "https://zxmfatrbfiwtxgbvtxqh.supabase.co/storage/v1/object/public/project-images/a87a4b01-1899-4d26-b55a-998e275d2dc2-adityanishad0402@gmail.com-1771763954112.png",
            "submitted_at": "2026-02-22T12:39:14.945983+00:00",
            "is_winner": false,
            "winner_placement": null,
            "totalVotes": 0
        }
    ],
    "event": {
        "name": "Monad Blitz Mumbai V2",
        "voting_start_time": "2026-02-22T13:15:00+00:00",
        "voting_end_time": "2026-02-22T16:20:00+00:00"
    }
}